.doom.d/config.org
#+TITLE: Doom Emacs Configuration
#+AUTHOR: valentin_lechner

* Introduction
#+BEGIN_QUOTE
Let us change our traditional attitude to the construction of programs:
Instead of imagining that our main task is to instruct a computer what to do,
let us concentrate rather on explaining to human beings what we want a
computer to do. --- Donald Knuth
#+END_QUOTE

* Configuration
#+BEGIN_SRC emacs-lisp :comments no
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+END_SRC
** Personal Information
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Valentin Lechner"
      user-mail-address "valentin_lechner@dismail.de")
#+END_SRC
These informations get used to identify you, e.g. ~GPG~ configuration,
email clients, file templates and snippets
** My defaults
Files without an alist entry get opened in org-mode
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("'" . org-mode) t)
#+END_SRC
full utf-8
#+BEGIN_SRC emacs-lisp
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
#+END_SRC
Only open one window on startup
#+BEGIN_SRC emacs-lisp
(add-hook 'emacs-startup-hook 'delete-other-windows t)
#+END_SRC
Please, don't indent using tabs.
Just specify tabs to be 4 whitespaces
#+BEGIN_SRC emacs-lisp
(setq  indent-tabs-mode nil)
#+END_SRC
Delete message buffers on exiting
#+BEGIN_SRC emacs-lisp
(setq message-kill-buffer-on-exit t)
#+END_SRC
Since I live in Germany, my week starts on monday.
#+BEGIN_SRC emacs-lisp
(setq calendar-week-start-day 1)
#+END_SRC
Move company tooltips to the right side
#+BEGIN_SRC emacs-lisp
(setq company-tooltip-align-annotations t)
#+END_SRC
I like zsh
#+BEGIN_SRC emacs-lisp
(setq explicit-shell-file-name "/bin/zsh")
#+END_SRC
Uniquify buffer names
#+BEGIN_SRC emacs-lisp
(setq  uniquify-buffer-name-style 'forward)
#+END_SRC
Take new window space from all windows, not just the active one
#+BEGIN_SRC emacs-lisp
(setq window-combination-resize t)
#+END_SRC
Increasing undo limit, I have enough space
This takes up max 80mb
#+BEGIN_SRC emacs-lisp
(setq undo-limit 80000000)
#+END_SRC
Making changes more granular for undo
#+BEGIN_SRC emacs-lisp
(setq evil-want-fine-undo t)
#+END_SRC
Autosaving
#+BEGIN_SRC emacs-lisp
(setq auto-save-default t)
#+END_SRC
show me the cursor when scrolling
#+BEGIN_SRC emacs-lisp
(beacon-mode)
#+END_SRC
Keep glyphs in cache when there are a lot
#+BEGIN_SRC emacs-lisp
(setq inhibit-compacting-font-caches t)
#+END_SRC
Use unicode ellipsis instead of ... - it saves a lot of space
#+BEGIN_SRC emacs-lisp
(setq truncate-string-ellipsis "…")
#+END_SRC
Set ivy buffer preview to on, since its nice
#+BEGIN_SRC emacs-lisp
(setq +ivy-buffer-preview t)
#+END_SRC
Ensure, company only helps when needed.
The author of doom, hlissner says to this on his personal config:
#+BEGIN_QUOTE
IMO, modern editors have trained a bad habit into us all: a burning
need for completion all the time -- as we type, as we breathe, as we
pray to the ancient ones -- but how often do you *really* need that
information? I say rarely. So opt for manual completion:
can be invoked using C-SPC
   --- hlissner
#+END_QUOTE
After working on a few large projects where you would SMASH the ESC-key to
cancel loading suggestions, I appreciate that opinion.
#+BEGIN_SRC emacs-lisp
(setq company-idle-delay nil)
#+END_SRC
Since the final newline did mess with my ~~/.authinfo.gpg~ for forge quite a lot
(it doesn't allow a final newline) I decided why not deactivate it.
#+BEGIN_SRC emacs-lisp
(setq require-final-newline nil)
#+END_SRC
I don't need the menu dashboard
#+BEGIN_SRC emacs-lisp
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
#+END_SRC
I like displaying whitespaces, returns and so on
A positive value activates it, negative turns it off
#+BEGIN_SRC emacs-lisp
(global-whitespace-mode +1)
#+END_SRC
I like the visual line mode
#+BEGIN_SRC emacs-lisp
(global-visual-line-mode +1)
#+END_SRC
Show battery and time in modeline
#+BEGIN_SRC emacs-lisp
(display-time-mode +1)
(display-battery-mode +1)
#+END_SRC
Add a splash image
#+BEGIN_SRC emacs-lisp
(setq fancy-splash-image (concat doom-private-dir "splash.png"))
#+END_SRC
warn me when opening a file larger than 100mb
#+BEGIN_SRC emacs-lisp
(setq-default large-file-warning-threshold 100000000)
#+END_SRC
set mouse to yank where i click: http://sachachua.com/blog/2017/04/emacs-pasting-with-the-mouse-without-moving-the-point-mouse-yank-at-point/
#+BEGIN_SRC emacs-lisp
(setq mouse-yank-at-point t)
#+END_SRC
** PATH
Setup path for cargo and texlive
#+BEGIN_SRC emacs-lisp
(setenv "PATH" (concat (getenv "PATH") ":/opt/texlive/2020/bin/x86_64-linux"))
(setq exec-path (append exec-path '("/opt/texlive/2020/bin/x86_64-linux")))

(setenv "PATH" (concat (getenv "PATH") ":/home/valentin/.cargo/bin"))
(setq exec-path (append exec-path '("/home/valentin/.cargo/bin")))
#+END_SRC
** UI Improvements
Changes the name of the dashboard to something recognisable
#+BEGIN_SRC emacs-lisp
(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")
#+END_SRC
this right here changes the foreground of not saved programs to something
not-red - no error happened, you can keep calm, its yellow and not red.
#+BEGIN_SRC emacs-lisp
(custom-set-faces!
  '(doom-modeline-buffer-modified :foreground "#57c7ff"))
#+END_SRC

We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case
#+BEGIN_SRC emacs-lisp
(defun doom-modeline-conditional-buffer-encoding ()
  "We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (unless (or (eq buffer-file-coding-system 'utf-8-unix)
                          (eq buffer-file-coding-system 'utf-8)))))

(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)
#+END_SRC

add transparency to emacs. only works with a composition manager
#+BEGIN_SRC emacs-lisp
(add-to-list 'default-frame-alist '(alpha 90 90))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq
 doom-font                          (font-spec :family "FiraCode Nerd Font Mono" :size 24)
 doom-big-font                   (font-spec :family "FiraCode Nerd Font Mono" :size 36)
 doom-variable-pitch-font (font-spec :family "ETBembo" :size 36)
 doom-serif-font                (font-spec :family "Liberation Serif" :weight 'light))
#+END_SRC
Theme settings
#+BEGIN_SRC emacs-lisp
(setq doom-theme 'doom-snazzy)
#+END_SRC
Have I stated yet that i like the relative numbering of lines?
it allows you to easily see how many lines up you have to go, then press that
number and the up key
#+BEGIN_SRC emacs-lisp
(setq display-line-numbers-type 'relative)
#+END_SRC
Change color of insert state to blue
#+BEGIN_SRC emacs-lisp
(custom-set-faces! '(doom-modeline-evil-insert-state
                     :weight bold
                     :foreground "#339CDB"))
#+END_SRC
** General keymaps
#+BEGIN_SRC emacs-lisp
(map! :map evil-window-map "SPC" #'rotate-layout)
#+END_SRC
** Projects
My Projects are under ~/Projekte. This tells projectile to index them:
#+BEGIN_SRC emacs-lisp
(setq
 projectile-project-search-path '("~/Projekte"))
#+END_SRC
** Org Mode
my default directory for org files
#+BEGIN_SRC emacs-lisp
(setq
 org-directory "~/Daten/cloud/tlaloc/org/"
 org-archive-location (concat org-directory ".archive/$s::")
)
#+END_SRC
This right here tells org to ignore ':ignore' tags, but to include the content
of them which i use for writing my thesis
#+BEGIN_SRC emacs-lisp
(after! org
  (require 'ox-extra)
  (ox-extras-activate '(ignore-headlines))
  (ox-extras-activate '(latex-header-blocks ignore-headlines)))
#+END_SRC
