.doom.d/config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

(setq user-full-name "Valentin Lechner"
      user-mail-address "valentin_lechner@dismail.de")

(add-to-list 'auto-mode-alist '("'" . org-mode) t)

(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(prefer-coding-system 'utf-8)

(add-hook 'emacs-startup-hook 'delete-other-windows t)

(setq  indent-tabs-mode nil)

(setq message-kill-buffer-on-exit t)

(setq calendar-week-start-day 1)

(setq company-tooltip-align-annotations t)

(setq explicit-shell-file-name "/bin/zsh")

(setq  uniquify-buffer-name-style 'forward)

(setq window-combination-resize t)

(setq undo-limit 80000000)

(setq evil-want-fine-undo t)

(setq auto-save-default t)

(beacon-mode)

(setq inhibit-compacting-font-caches t)

(setq truncate-string-ellipsis "…")

(setq +ivy-buffer-preview t)

(setq company-idle-delay nil)

(setq require-final-newline nil)

(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)

(global-whitespace-mode +1)

(global-visual-line-mode +1)

(display-time-mode +1)
(display-battery-mode +1)

(setq fancy-splash-image (concat doom-private-dir "splash.png"))

(setq-default large-file-warning-threshold 100000000)

(setq mouse-yank-at-point t)

(setenv "PATH" (concat (getenv "PATH") ":/opt/texlive/2020/bin/x86_64-linux"))
(setq exec-path (append exec-path '("/opt/texlive/2020/bin/x86_64-linux")))

(setenv "PATH" (concat (getenv "PATH") ":/home/valentin/.cargo/bin"))
(setq exec-path (append exec-path '("/home/valentin/.cargo/bin")))

(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")

(custom-set-faces!
  '(doom-modeline-buffer-modified :foreground "#57c7ff"))

(defun doom-modeline-conditional-buffer-encoding ()
  "We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (unless (or (eq buffer-file-coding-system 'utf-8-unix)
                          (eq buffer-file-coding-system 'utf-8)))))

(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)

(add-to-list 'default-frame-alist '(alpha 90 90))

(setq
 doom-font                          (font-spec :family "FiraCode Nerd Font Mono" :size 24)
 doom-big-font                   (font-spec :family "FiraCode Nerd Font Mono" :size 36)
 doom-variable-pitch-font (font-spec :family "ETBembo" :size 36)
 doom-serif-font                (font-spec :family "Liberation Serif" :weight 'light))

(setq doom-theme 'doom-snazzy)

(setq display-line-numbers-type 'relative)

(custom-set-faces! '(doom-modeline-evil-insert-state
                     :weight bold
                     :foreground "#339CDB"))

(map! :map evil-window-map "SPC" #'rotate-layout)

(setq
 projectile-project-search-path '("~/Projekte"))

(setq
 org-directory "~/Daten/cloud/tlaloc/org/"
 org-archive-location (concat org-directory ".archive/$s::")
)

(after! org
  (require 'ox-extra)
  (ox-extras-activate '(ignore-headlines))
  (ox-extras-activate '(latex-header-blocks ignore-headlines)))

(setq
  org-ellipsis " ▼ "
