.doom.d/config.el

(setq org-agenda-files (list org-directory))

(defun org-summary-todo (n-done n-not-done)
  "Switch entry to DONE when all subentries are done, to TODO otherwise."
  (let (org-log-done org-log-states)   ; turn off logging
    (org-todo (if (= n-not-done 0) "DONE" "TODO"))))

(add-hook 'org-after-todo-statistics-hook 'org-summary-todo)
(setq org-hierarchical-todo-statistics t)

(add-hook 'org-mode-hook
          (lambda ()
            (push '("TODO"  . ?▲) prettify-symbols-alist)
            (push '("DONE"  . ?✓) prettify-symbols-alist)
            (push '("CANCELLED"  . ?✘) prettify-symbols-alist)
            (push '("WAITING"  . ?…) prettify-symbols-alist)
            (push '("SOMEDAY"  . ??) prettify-symbols-alist)))

(setq org-fontify-done-headline t)
(custom-set-faces
 '(org-done ((t (:foreground "PaleGreen"
                 :weight normal
                 :strike-through t))))
 '(org-headline-done
   ((((class color) (min-colors 16) (background dark))
     (:foreground "LightSalmon" :strike-through t)))))

(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "<f12>") 'org-agenda-list)

(setq org-agenda-sorting-strategy
  (quote ((agenda time-up priority-down category-up)
          (todo todo-state-up priority-up)
          (tags priority-down))))

  ;; ! => insert timestamp
  ;; @ => insert note
  ;; / => enter state
  ;; (x) => shortcut (after C-c C-t)
  ;; after the |: close todo
(setq  org-todo-keywords '((sequence  "DELEGATED(l@/!)" "SOMEDAY(f)" "IDEA(i@/!)"
  "TODO(t@/!)" "STARTED(s@/!)" "NEXT(n@/!)" "WAITING(w@/!)" "|" "DONE(d@/!)"
  "CANCELED(c@/!)")))

(setq  org-todo-keyword-faces
  '(("IDEA" . (:foreground "GoldenRod" :weight bold))
    ("NEXT" . (:foreground "IndianRed1" :weight bold))
    ("TODO" . (:foreground "Yellow1" :weight bold))
    ("STARTED" . (:foreground "OrangeRed" :weight bold))
    ("WAITING" . (:foreground "coral" :weight bold))
    ("CANCELED" . (:foreground "IndianRed2" :weight bold))
    ("DELEGATED" . (:foreground "ForestGreen" :weight bold))
    ("SOMEDAY" . (:foreground "YellowGreen" :weight bold))
    )
)

(setq
  org-tag-persistent-alist
  '((:startgroup . nil)
    ("HOME" . ?h)
    ("RESEARCH" . ?r)
    ("TEACHING" . ?t)
    ("STUDYING" . ?s)
    (:endgroup . nil)
    (:startgroup . nil)
    ("MGMT" . ?m)
    ("OS" . ?o)
    ("DEV" . ?d)
    ("WWW" . ?w)
    (:endgroup . nil)
    (:startgroup . nil)
    ("EASY" . ?e)
    ("MEDIUM" . ?m)
    ("HARD" . ?a)
    (:endgroup . nil)
    ("URGENT" . ?u)
    ("KEY" . ?k)
    ("BONUS" . ?b)
    ("noexport" . ?x)
    )
)

(setq
  org-tag-faces
  '(
    ("HOME" . (:foreground "AquaMarine4" :weight bold))
    ("RESEARCH" . (:foreground "Seagreen4" :weight bold))
    ("TEACHING" . (:foreground "Green4" :weight bold))
    ("STUDYING" . (:foreground "Springgreen4" :weight bold))
    ("OS" . (:foreground "coral4" :weight bold))
    ("DEV" . (:foreground "tomato1" :weight bold))
    ("MGMT" . (:foreground "yellow1" :weight bold))
    ("WWW" . (:foreground "gray0" :weight bold))
    ("URGENT" . (:foreground "Red" :weight bold))
    ("KEY" . (:foreground "Red" :weight bold))
    ("EASY" . (:foreground "Green1" :weight bold))
    ("MEDIUM" . (:foreground "Yellow1" :weight bold))
    ("HARD" . (:foreground "Red1" :weight bold))
    ("BONUS" . (:foreground "GoldenRod" :weight bold))
    ("noexport" . (:foreground "YellowGreen" :weight bold))
    )
  )

(setq org-todo-repeat-to-state "NEXT")

(setq
  org-fast-tag-selection-single-key t
  org-use-fast-todo-selection t
)

(setq
 org-ref-default-bibliography "~/Daten/cloud/tlaloc/org/Papers/references.bib"

 org-ref-pdf-directory "~/Daten/cloud/tlaloc/org/Papers/bibtex-pdfs"

 org-ref-bibliography-notes "~/Daten/cloud/tlaloc/org/Papers/notes.org"
 org-ref-open-pdf-function
 (lambda (fpath)
   (start-process "zathura" "*ivy-bibtex-zathura*" "/usr/bin/zathura" fpath))
)

(setq org-ref-default-citation-link "footcite")

(setq org-latex-prefer-user-labels t)

(setq org-export-with-smart-quotes t)

(setq
